#ifndef IMAGES_C_CLEF
#define IMAGES_C_CLEF

namespace images {
    /*!
     * Данная константа хранит количество опорных точек в ключе до
     */
    constexpr uint8_t c_clef_size = 45;

    const std::vector<std::pair<uint8_t, uint8_t>> c_clef = {
        {11, 40}, {11, 2},  {11, 77}, {11, 40}, {20, 40}, {20, 2},  {20, 77}, {20, 40}, {25, 40},
        {28, 34}, {29, 23}, {30, 32}, {37, 35}, {44, 35}, {49, 29}, {50, 10}, {42, 4},  {33, 4},
        {29, 10}, {32, 15}, {29, 10}, {33, 4},  {42, 4},  {50, 10}, {49, 29}, {44, 35}, {37, 35},
        {30, 32}, {29, 23}, {28, 34}, {25, 40}, {20, 40}, {28, 45}, {29, 56}, {32, 47}, {38, 45},
        {44, 45}, {49, 50}, {49, 69}, {46, 73}, {40, 76}, {33, 76}, {29, 73}, {29, 68}, {31, 65}};
} // namespace images

#endif // IMAGES_C_CLEF
