#ifndef IMAGES_TREBLE_CLEF
#define IMAGES_TREBLE_CLEF

/*!
 * Данное пространство имен хранит опорные точки для рисования различных оъектов, таких, как ключи и знаки
 */
namespace images {
    /*!
     * Данная константа хранит количество опорных точек скрипичного ключа
     */
    constexpr uint8_t treble_clef_size = 34;

    /*!
     * Данная константа хранит опорные точки скрипичного ключа
     */
    const std::vector<std::pair<uint16_t, uint16_t>> treble_clef = {
        {72, 355},  {78, 327},  {93, 303},  {107, 292}, {135, 284}, {150, 284}, {166, 291}, {182, 304}, {199, 338},
        {195, 383}, {183, 409}, {170, 421}, {152, 434}, {135, 439}, {94, 440},  {50, 425},  {30, 404},  {19, 380},
        {17, 325},  {37, 283},  {66, 247},  {134, 171}, {160, 117}, {168, 60},  {160, 25},  {135, 16},  {108, 32},
        {92, 130},  {145, 460}, {140, 530}, {119, 553}, {80, 550},  {60, 528},  {57, 510}};
} // namespace images

#endif // IMAGES_TREBLE_CLEF
